app/controllers/personals_controller.rb

  def create
    @personal = Personal.new(personal_params)

    respond_to do |format|
      if @personal.save
---
INSERT INTO `personals` (`first_name`, `last_name`, `nickname`, `email_address`, `phone_number`, `created_at`, `updated_at`) VALUES ('Matt', 'Bruen', NULL, 'alden@schuppe.example', '1044563113', '2023-07-10 10:23:41.816364', '2023-07-10 10:23:41.816364')